# 面向资源设计

本指南的目的是帮助开发者设计简单的、一致的和方便使用的网络API。同时，它还帮助融合基于套接字的 RPC API 和基于 HTTP 的 REST API 的设计。

传统上，人们根据API接口和方法来设计RPC API，例如 CORBA 和 Windows COM。随着时间的推移，越来越多的接口和方法被引入。最终的结果就是巨多各种不同的接口和方法。开发者们为了准确的使用这些接口和方法，必须认真的学习使用，不仅耗时且容易出错。

REST的架构风格在2000年首次被引入，主要设计为与 HTTP/1.1 一起使用。其核心原则是定义可以使用少量方法操纵的命名资源。资源和方法被认为是API的名词和动词。在HTTP协议中，资源名自然是对应URL，方法名自然是对应HTTP的方法 POST、GET、PUT、PATCH 和 DELETE。

近些年 HTTP REST API 的使用在互联网中非常的成功。在2010年大概74%的公共网络API是HTTP REST API。

尽管HTTP REST API在Internet上非常流行，但它们所携带的流量比传统的RPC API小。例如在高峰时间，美国大约一半的互联网流量是视频，由于性能原因，很少有人会考虑使用 REST API 来提供此类内容。许多公司的数据中心内部都是用基于套接字的RPC API来承载大多数网络流量，对比公共 REST API 性能能有数量级的提升。

实际上，因为各种原因，RPC API 和 HEEP REST API是需要同时存在的。理想情况下，API平台应为所有API提供最佳支持。本设计指南帮助你们设计和构建符合这个原则的API。它通过将一种面向资源的设计原则应用于通用的API设计，并定义了许多常见的设计模式，以提高可用性和降低复杂性。

注意：本指南解释了如何应用REST原则来设计API，是独立于编程语言、操作系统或者网络协议的。它也不仅仅是创建REST API的指南。

## 什么是REST API

REST API被建模为可单独寻址的资源集合（API的名词）。资源通过他们的资源名被使用，通过简短的几个方法（也称为动词或操作）被操作。

谷歌的REST API（也称为 REST 方法）标准方法是 `List`、`Get`、`Create`、`Update` 和 `Delete`。API设计者还可以使用自定义方法（也称为自定义动词或自定义操作）来实现不容易映射到标准方法的功能，例如数据库事务。

注意：自定义动词并不意味着创建自定义 HTTP 方法以支持自定义方法。对于基于HTTP的API，它们只是映射到最合适的 HTTP 方法。

## 设计流程

本设计指南建议在设计面向资源的API时采取以下步骤（更多详细信息将在下面的特定部分中介绍）：

	* 确定API提供什么类型的资源。
	* 确定资源之间的关系。
	* 根据类型和关系确定资源命名方案。
	* 确定资源模式。
	* 给资源设计最少的方法。

## 资源

面向资源的 API 通常被建模为资源层次结构，其中每个节点又可能是简单资源或资源集合。为了方便起见，它们通常分别称为资源和集合。

	* 一个集合包含一系列相同类型的资源。例如，一个用户拥有一个联系人的集合。
	* 一个资源拥有一些状态，可能会有若干子资源。每个子资源可以是一个简单资源或者一个资源集合。

例如，Gmail API 有用户集合，每个用户都有消息集合，消息列表集合，标签集合，一个配置文件资源和几个设置资源。

尽管存储系统和REST API之间存在一些概念上的一致性，但是有面向资源的API的服务不一定是数据库，并且在解释资源和方法方面具有巨大的灵活性。例如，创建日历事件（资源）可以为参加者创建附加事件，向参加者发送电子邮件邀请，预约会议室和更新视频会议时间表。

## 方法

面向资源的API的关键特性是，它强调与操作资源的方法（功能）相关的资源（数据模型）。典型的面向资源的API通过少量方法暴露大量资源。方法可以是标准方法或自定义方法。 对于本指南，标准方法是：`List`、`Get`、`Create`、`Update` 和 `Delete`。

当API功能自然地映射到一个标准方法时，应该在API设计中使用该方法。对于不能自然地映射到标准方法之一的功能，可以使用自定义方法。自定义方法提供与传统RPC API相同的设计自由，可用于实现常见的编程模式，如数据库事务或数据分析。

## 例子

以下部分介绍了一些关于如何将面向资源的API设计应用于大规模服务的现实示例。

### Gmail API

Gmail API服务实现了Gmail API，并提供了大多数Gmail功能。 它有以下资源模型：

	* Gmail API 服务: `gmail.googleapis.com`
	* 用户集合: `users/*`. 每个用户都有以下资源.
		* 消息集合：`users/*/messages/*`。
		* 消息列表集合：`users/*/threads/*`。
		* 标签集合：`users/*/labels/*`。
		* 变更历史记录的集合：`users/*/history/*`。
		* 表示用户配置文件的资源：`users/*/profile`。
		* 表示用户设置的资源：`users/*/settings`。

### Google Cloud Pub/Sub API

`pubsub.googleapis.com` 服务实现了 Google Cloud Pub/Sub API，其中定义了以下资源模型：

	* API服务：`pubsub.googleapis.com`
	* 主题集合：`projects/*/topics/*`。
	* 订阅集合：`projects/*/subscriptions/*`。

注意：Pub/Sub API其他的实现可能会选择不同的资源命名方案。





